In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('./training/SavedData.csv')
df

,town,flat_type,flat_model,floor_area_sqm,street_name,resale_price,month,remaining_lease,lease_commence_date,storey_range,_id,block
0,SERANGOON,EXECUTIVE,Maisonette,152.0,SERANGOON NTH AVE 4,720000.0,2017-02,74 years 09 months,1992,04 TO 06,1,526
1,SERANGOON,EXECUTIVE,Maisonette,152.0,SERANGOON NTH AVE 4,725000.0,2017-02,74 years 09 months,1992,10 TO 12,2,525
2,SERANGOON,EXECUTIVE,Maisonette,154.0,SERANGOON CTRL,938888.0,2017-02,70 years 11 months,1989,10 TO 12,3,423
3,TAMPINES,3 ROOM,Simplified,64.0,TAMPINES ST 83,290000.0,2017-02,69 years 09 months,1987,01 TO 03,4,849
4,TAMPINES,3 ROOM,Simplified,64.0,TAMPINES ST 44,292000.0,2017-02,69 years 05 months,1987,10 TO 12,5,462
...,...,...,...,...,...,...,...,...,...,...,...,...
130092,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 22,715000.0,2022-07,62 years 02 months,1985,01 TO 03,130093,277
130093,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 61,740000.0,2022-07,63 years 10 months,1987,04 TO 06,130094,614
130094,YISHUN,EXECUTIVE,Apartment,145.0,YISHUN ST 71,720000.0,2022-07,62 years 11 months,1986,07 TO 09,130095,723
130095,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 71,678000.0,2022-07,63 years 01 month,1986,04 TO 06,130096,724
130096,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 71,705000.0,2022-07,63 years 01 month,1986,01 TO 03,130097,724

In [4]:
df['price_per_sq_m'] = df['resale_price']/df['floor_area_sqm']
df['month_datetime'] = pd.to_datetime(df['month'])

df

,town,flat_type,flat_model,floor_area_sqm,street_name,resale_price,month,remaining_lease,lease_commence_date,storey_range,_id,block,price_per_sq_m,month_datetime
0,SERANGOON,EXECUTIVE,Maisonette,152.0,SERANGOON NTH AVE 4,720000.0,2017-02,74 years 09 months,1992,04 TO 06,1,526,4736.842105,2017-02-01
1,SERANGOON,EXECUTIVE,Maisonette,152.0,SERANGOON NTH AVE 4,725000.0,2017-02,74 years 09 months,1992,10 TO 12,2,525,4769.736842,2017-02-01
2,SERANGOON,EXECUTIVE,Maisonette,154.0,SERANGOON CTRL,938888.0,2017-02,70 years 11 months,1989,10 TO 12,3,423,6096.675325,2017-02-01
3,TAMPINES,3 ROOM,Simplified,64.0,TAMPINES ST 83,290000.0,2017-02,69 years 09 months,1987,01 TO 03,4,849,4531.250000,2017-02-01
4,TAMPINES,3 ROOM,Simplified,64.0,TAMPINES ST 44,292000.0,2017-02,69 years 05 months,1987,10 TO 12,5,462,4562.500000,2017-02-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
130092,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 22,715000.0,2022-07,62 years 02 months,1985,01 TO 03,130093,277,4897.260274,2022-07-01
130093,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 61,740000.0,2022-07,63 years 10 months,1987,04 TO 06,130094,614,5068.493151,2022-07-01
130094,YISHUN,EXECUTIVE,Apartment,145.0,YISHUN ST 71,720000.0,2022-07,62 years 11 months,1986,07 TO 09,130095,723,4965.517241,2022-07-01
130095,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 71,678000.0,2022-07,63 years 01 month,1986,04 TO 06,130096,724,4643.835616,2022-07-01
130096,YISHUN,EXECUTIVE,Maisonette,146.0,YISHUN ST 71,705000.0,2022-07,63 years 01 month,1986,01 TO 03,130097,724,4828.767123,2022-07-01

In [5]:
df_grouped = df.groupby('month_datetime').mean()
df_grouped

,floor_area_sqm,resale_price,lease_commence_date,_id,price_per_sq_m
month_datetime,,,,,
2017-02-01,104.074074,438847.288889,1990.703704,135.5,4229.048203
2017-03-01,97.140988,445029.896942,1992.283237,1222.0,4624.392670
2017-04-01,97.084285,438629.272235,1992.362697,3093.0,4564.304184
2017-05-01,97.435000,443789.321212,1992.696465,5002.5,4592.097633
2017-06-01,98.061420,448502.036062,1992.929021,6866.0,4615.460329
...,...,...,...,...,...
2022-03-01,96.869275,536441.163024,1996.638815,120144.5,5592.196061
2022-04-01,97.834951,544842.923071,1997.216681,122408.5,5618.073513
2022-05-01,96.323134,545866.347594,1997.599444,124620.0,5717.502896
2022-06-01,97.897662,557157.805049,1997.572698,126768.0,5749.092257
2022-07-01,97.406239,557871.326549,1996.904867,128967.5,5772.167188

In [6]:
df_price_trend = df_grouped.reset_index()[['month_datetime', 'price_per_sq_m']]
df_price_trend

   month_datetime  price_per_sq_m
0      2017-02-01     4229.048203
1      2017-03-01     4624.392670
2      2017-04-01     4564.304184
3      2017-05-01     4592.097633
4      2017-06-01     4615.460329
..            ...             ...
61     2022-03-01     5592.196061
62     2022-04-01     5618.073513
63     2022-05-01     5717.502896
64     2022-06-01     5749.092257
65     2022-07-01     5772.167188

[66 rows x 2 columns]